app/Http/Controllers/Api/ExamController.php

select * from `exams` where `course` = '1' and `user_id` = 42 and `is_done` = 0
---
    public function enroll(Course $course)
    {
        try {
            if ($course->isfree == 1) {

                $course->vedio = json_decode($course->vedio, true);
                return response()->json(['course' => $course]);

            }
            $id = request()->user()->id;
            $userMac = request()->user()->mac;
            $qrCode = view_teacher_lesson_qr::where('student_id', '=', $id)
                ->where('lesson_id', '=', $course->id)->where('valid_till', '>', Carbon::now());
            if (empty($qrCode->where('used', '=', 1)->get()->all())) {
                $data = [
                    'user' => request()->user()->fullname(),
                    'course' => $course->id,
                ];
                Log::create(['Log' => 'The QrCode Is Expirad OR You Never Enorlled In That Lesson', 'user' => request()->user()->id, 'data' => json_encode($data), 'route' => request()->route()->uri()]);
                //The QrCode Is Expirad OR You Never Enorlled In That Lesson
                return response()->json(['error' => 'الكيو ار كود انتهت صلاحياته او لم يتم اضافته'], 402);
            }
            $mac = $qrCode->where('used', '=', 1)->get()->all();
            dd($mac);
            if ($mac->mac != $userMac) {
                return response()->json(['error' => 'عفوا يجب مشاهده الدرس من نفس الجهاز الذي تم تفعيله عليه'], 403);
            }
            $exam = Exam::where('is_done', '=', 0)->where('course', '>', $course->id)->where('user_id', '=', $id)->get();