app/Models/Teachers.php

select * from `teachers` where `user_id` = 1
---
    public static function isTeacher(){
        $id = auth()->user()->belongs_to_teacher == 0 ? auth()->id() : auth()->user()->belongs_to_teacher;

        $result = parent::where('user_id', '=', $id)->get();